INSERT INTO companies (id, name, description, created_at, updated_at)
VALUES
    (1, 'A株式会社', 'A株式会社の説明', '2024-01-01 00:00:00', '2024-01-01 00:00:00'),
    (2, 'B株式会社', 'B株式会社の説明', '2024-01-02 00:00:00', '2024-01-02 00:00:00'),
    (3, 'C株式会社', 'C株式会社の説明', '2024-01-03 00:00:00', '2024-01-03 00:00:00');

INSERT INTO products (id, company_id, name, price, description, created_at, updated_at)
VALUES
    (1, 1, 'A商品', 1000, 'A商品の説明', '2024-01-01 00:00:00', '2024-01-01 00:00:00'),
    (2, 1, 'B商品', 2000, 'B商品の説明', '2024-01-02 00:00:00', '2024-01-02 00:00:00'),
    (3, 2, 'C商品', 3000, 'C商品の説明', '2024-01-03 00:00:00', '2024-01-03 00:00:00');

INSERT INTO orders (id, product_id, quantity, created_at, updated_at)
VALUES
    (1, 1, 10, '2024-01-01 00:00:00', '2024-01-01 00:00:00'),
    (2, 1, 20, '2024-01-02 00:00:00', '2024-01-02 00:00:00'),
    (3, 2, 30, '2024-01-03 00:00:00', '2024-01-03 00:00:00');
